{
	"sep-2014": {
		"title": "Seventh Meetup: Creating Automating and Testing",
		"date": "TBD",
		"thumbnail": "http://upload.wikimedia.org/wikipedia/en/thumb/1/13/Canadian_Tire_Logo.svg/189px-Canadian_Tire_Logo.svg.png",
		"thumbAltText": "",
		"synopsis": [
			"Come join us for back to school action at the Canadian Tire Innovation Centre. We will try to have three shorter talks with pizza and networking breaks in between."
		],
		"location": "Canadian Tire Data Centre"
	},
	"jun-18-2014": {
		"title": "Sixth Meetup: \"Microsoft <3 Javascript\" & \"Introduction to Angular and Breeze\"",
		"date": "2014-06-18 17:30",
		"thumbnail": "http://upload.wikimedia.org/wikipedia/commons/9/99/Unofficial_JavaScript_logo_2.svg",
		"thumbAltText": "",
		"synopsis": [
			"This time we have two speakers: D'Arcy Lussier and Mike Sigsworth. At this event D'Arcy Lussier will tell us about Microsoft's new love for JavaScript and their support for open source JavaScript frameworks. Mike Sigsworth will show us how to develop applications using AngularJS, Breeze.js and Hot Towel." 
		],
		"eventbrite": "http://www.eventbrite.com/e/sixth-meetup-microsoft-3-javascript-intro-to-angular-and-breeze-tickets-11818823419",
		"location": "SkullSpace"
	},
	"may-12-2014": {
		"title": "Fifth Meetup: A New Vision",
		"date": "2014-05-12 19:00",
		"thumbnail": "http://upload.wikimedia.org/wikipedia/en/thumb/1/13/Canadian_Tire_Logo.svg/189px-Canadian_Tire_Logo.svg.png",
		"thumbAltText": "Canadian Tire",
		"synopsis": [
			" Let's meetup again and bring this community back on track again. The JS related topic for this meetup is not yet determined and will be announced later but Adam Merrifield and Craig Haney from the Canadian Tire Innovations in Kitchener will talk about their vision for Winnipeg's developer community and Canadian Tire's new design studio.",
			"Let's get together, share our experiences, catch up and have simply fun hanging out."
		],
		"eventbrite": "https://www.eventbrite.ca/e/a-new-vision-tickets-11522416859",
		"location": "Canadian Tire Data Centre"
	},
	"feb-20-2013": {
		"title": "Fourth Meetup: Introduction to CoffeeScript",
		"date": "2013-02-20 18:00",
		"thumbnail": "/images/coffeescript-logo.png",
		"thumbAltText": "CoffeeScript",
		"synopsis": [
			"CoffeeScript is a small language that compiles to Javascript that aims to solve many of the short comings of javascript (the bad parts). It makes it easier to write less code that does more in a simple and elegant way.",
			"Kevin Quiring will be talking about CoffeeScript and how his team at Winnipeg Transit is using it to help them solve real problems."
		],
		"eventbrite": "http://www.eventbrite.com/event/5515131908",
		"location": "UofM SmartPark"
	},
	"nov-21-2012": {
		"title": "Third Meetup: Phonegap - Cross Platform Mobile Development",
		"date": "2012-11-21 18:00",
		"thumbnail": "/images/phonegap-logo.png",
		"thumbAltText": "PhoneGap",
		"synopsis": [
			"Phonegap is a platform that bridges the shortcomings of standard mobile web and native applications. It provides a standard API and tools to produce a compiled native application, while still using Javascript as our language of choice.",
			"We will first discuss Mobile Web, see how far its come and see a simple demonstration of what it can do. Then, we will move onto Phonegap, what problems it solves, how it can be extended and some caveats of the platform."
		],
		"eventbrite": "http://www.eventbrite.com/event/4841163049",
		"location": "UofM SmartPark"
	},
	"oct-30-2012": {
		"title": "Second Meetup: Test Driven Development",
		"date": "2012-10-30 18:00",
		"thumbnail": "/images/jasmin-logo.png",
		"thumbAltText": "Jasmine",
		"synopsis": [
			"Test Driven Development is software development methodology based on \"test first\" approach.",
			"That means that before even writing a line of code we need to write a test for it.",
			"The idea seems fine for languages like C# however what about Javascript? Javascript is quite a popular language (if not the most) so, are we condemned to test the UI every time I want to test my JS code? Why can't we do TDD with it?",
			"Of course we can! Join me on a session to discuss how to start with Jasmine, a JS library for testing in general, that provides great syntax to use TDD. I assure you your JS code will never be the same!"
		],
		"eventbrite": "http://www.eventbrite.com/event/4657304122",
		"location": "UofM SmartPark"
	},
	"sep-26-2012": {
		"title": "First Meetup: Intro to Node.js",
		"date": "2012-09-26 18:00",
		"thumbnail": "/images/nodejs-logo.jpg",
		"thumbAltText": "Node.js",
		"synopsis": [
			"We decided to do our first meeting about one of the hottest topics in the development world",
			"We will start with a quick introduction to Node.js and then go over a few uses of Node.js and when not to use it. We will then dive into a few popular frameworks and see what each is good for and which you should use for your projects. <a href=\"/events/sep-26-2012\">More</a>"
		],
		"eventbrite": "http://www.eventbrite.com/event/4414239108?ref=elink",
		"location": "UofM SmartPark"
	}
}
